Revit 2024 API
KeyBasedTreeEntriesLoadContent Class
 This class is used by IExternalResourceServers to return KeyBasedTreeEntries data to Revit when their LoadResource method is invoked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class KeyBasedTreeEntriesLoadContent : ExternalResourceLoadContent
Visual Basic
Public Class KeyBasedTreeEntriesLoadContent _
	Inherits ExternalResourceLoadContent
Visual C++
public ref class KeyBasedTreeEntriesLoadContent : public ExternalResourceLoadContent
Remarks
The class contains a KeyBasedTreeEntries object which should hold the KeyBasedTreeEntries data generated by the IExternalResourceServer.
An ExternalResourceServer can create the KeyBasedTreeEntries from an arbitrary data source by using AddEntry to add individual KeyBasedTreeEntries. Once all the desired entries have been added, BuildEntries can be called to construct the KeyBasedTreeEntries object from the individual entries that were added.
KeyBasedTreeEntriesLoadContent must have a built KeyBasedTreeEntries before its LoadStatus property can be set to ExternalResourceLoadStatus.Success.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceLoadContent
 Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
See Also
KeyBasedTreeEntriesLoadContent Members
Autodesk.Revit.DB Namespace